---
kind: property
id: P:Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveShape
source: html/4ed96171-c8ac-1623-f1d3-5da38d1bd834.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveShape Property

Verifies that the crop of the associated view is permitted to have a non-rectangular shape.

## Syntax (C#)
```csharp
public bool CanHaveShape { get; }
```